---
kind: property
id: P:Autodesk.Revit.DB.Events.FileExportedEventArgs.Format
source: html/4164a099-3fbe-27fc-34ac-b052c436b4e3.htm
---
# Autodesk.Revit.DB.Events.FileExportedEventArgs.Format Property

Identifies the export format, e.g. DWG or image.

## Syntax (C#)
```csharp
public ImportExportFileFormat Format { get; }
```